products/wssagents/samples/glassfish/StockQuoteClient/web/WEB-INF/wsdl/client/StockService/StockService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--
   The contents of this file are subject to the terms
   of the Common Development and Distribution License
   (the License). You may not use this file except in
   compliance with the License.

   You can obtain a copy of the License at
   https://opensso.dev.java.net/public/CDDLv1.0.html or
   opensso/legal/CDDLv1.0.txt
   See the License for the specific language governing
   permission and limitations under the License.

   When distributing Covered Code, include this CDDL
   Header Notice in each file and include the License file
   at opensso/legal/CDDLv1.0.txt.
   If applicable, add the following below the CDDL Header,
   with the fields enclosed by brackets [] replaced by
   your own identifying information:
   "Portions Copyrighted [year] [name of copyright owner]"

   $Id: StockService.wsdl,v 1.3 2008-06-15 07:24:32 mrudul_uchil Exp $

   Copyright 2006 Sun Microsystems Inc. All Rights Reserved
-->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:tns="http://sun.com/stockquote.wsdl" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsd1="http://sun.com/stockquote.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsap10="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" targetNamespace="http://sun.com/stockquote.wsdl">
<wsp:Policy wsu:Id="IStockService_policy">
		<wsp:ExactlyOne>
			<wsp:All>
				<wsap10:UsingAddressing/>
			</wsp:All>
		</wsp:ExactlyOne>
</wsp:Policy>
<types>
        <xsd:schema>
            <xsd:import namespace="http://sun.com/stockquote.xsd" schemaLocation="stock.xsd"/>
        </xsd:schema>
</types>
<message name="QuoteRequest">
        <part name="body" element="xsd1:QuoteRequest"/>
    </message>
<message name="QuoteResponse">
        <part name="body" element="xsd1:QuoteResponse"/>
    </message>
<portType name="StockQuotePortType">
        <operation name="GetStockQuote">
            <input message="tns:QuoteRequest"/>
            <output message="tns:QuoteResponse"/>
        </operation>
     </portType>
<binding name="StockQuoteBinding" type="tns:StockQuotePortType">
    <wsp:PolicyReference URI="#IStockService_policy"/>
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="GetStockQuote">
           <soap:operation soapAction="http://sun.com/GetStockQuote"/>
           <input>
               <soap:body use="literal"/>
           </input>
           <output>
               <soap:body use="literal"/>
           </output>
        </operation>
    </binding>
<wsdl:service xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="StockService">
<wsdl:port name="StockQuotePortTypePort" binding="tns:StockQuoteBinding">
<soap:address location="http://localhost:8080/StockService/StockService"/>
</wsdl:port>
</wsdl:service>
</definitions>
